app/views/users/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 2]]
---
  <h2>投稿内容</h2>
  <% @user.posts.each do |post| %>