app/views/posts/show.html.erb

  <h3>内容:<%= @post.content %></h3>
  <h3>参加者: <%= @post.likes.count %>人</h3>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 1]]