app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "集合ー"], ["user_id", 1], ["created_at", "2020-02-21 13:01:15.102625"], ["updated_at", "2020-02-21 13:01:15.102625"]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.save