app/models/user.rb

  def already_liked?(post)
    self.likes.exists?(post_id: post.id)
---
SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 1], ["LIMIT", 1]]